INSERT INTO `список жанров` (`ID Жанра`, `Название жанра`) VALUES
	(1, 'Джайв'),
	(2, 'Хаус'),
	(3, 'Альткор');

INSERT INTO `список треков` (`ID Трека`, `Название трека`, `Длительность`, `ID Альбома`) VALUES
	(1, 'Пролог', '00:02:30', 1),
	(2, 'В полумраке', '00:03:57', 1),
	(3, 'Общий сбор', '00:05:00', 1),
	(4, 'Нарастающий рокот', '00:04:14', 2),
	(5, 'Мой последний вздох', '00:02:48', 2),
	(6, 'Финальная искра', '00:07:00', 2),
	(7, 'Рассвет', '00:01:30', 3),
	(8, 'Зенит', '00:02:21', 3),
	(9, 'Закат', '00:06:52', 3);

INSERT INTO `список авторов` (`ID Автора`, `Имя автора`) VALUES
	(1, 'Виталий К.'),
	(2, 'Вечно Идущий'),
	(3, 'Лампада'),
	(4, 'Просто Антон'),
	(5, 'Зинаида Л.'),
	(6, 'Белая Плесень');

INSERT INTO `список альбомов` (`ID Альбома`, `Название альбома`, `Дата выпуска`) VALUES
	(1, 'Вереница', '2024-09-22'),
	(2, 'Полная луна', '2015-04-22'),
	(3, 'Завтрашний день', '2020-10-10');

INSERT INTO `список сборников` (`ID Сборника`, `Название сборника`, `Год выхода`) VALUES
	(1, 'Бодрый', '2026'),
	(2, 'Медитация', '2023'),
	(3, 'Прогрессия', '2017'),
	(4, 'Настрой', '2020');

-- По тому, как выглядит инсерт реквест понятно и видно где у нас вторичные таблицы, которые целиком и полностью зависят от других.

INSERT INTO `сборник треков` (`ID Сборника`, `ID Трека`) VALUES
	(1, 3),
	(1, 5),
	(2, 2),
	(2, 8),
	(3, 3),
	(3, 7),
	(4, 2),
	(4, 6);

INSERT INTO `исполнители альбомов` (`ID Альбома`, `ID Автора`) VALUES
	(1, 1),
	(1, 3),
	(1, 6),
	(2, 2),
	(2, 4),
	(3, 4),
	(3, 5),
	(3, 6);

INSERT INTO `жанры автора` (`ID Автора`, `ID Жанра`) VALUES
	(1, 1),
	(1, 3),
	(2, 2),
	(3, 1),
	(3, 2),
	(4, 3),
	(5, 2),
	(5, 3),
	(6, 1);
